In [1]:
import numpy as np
import pandas as pd

string_data = pd.Series(['板橋區', '中和區', np.nan, '土城區'])
string_data

0    板橋區
1    中和區
2    NaN
3    土城區
dtype: object

In [3]:
#檢查有沒有空的資料
#isnull()
string_data[string_data.isnull()]

2    NaN
dtype: object

In [5]:
#檢查有沒有空的資料
#notnull()
string_data[string_data.notnull()]

0    板橋區
1    中和區
3    土城區
dtype: object

In [7]:
#清除nan資料
#dropna()
string_data = pd.Series(['板橋區', '中和區', np.nan, '土城區'])
string_data

0    板橋區
1    中和區
2    NaN
3    土城區
dtype: object

In [8]:
string_data.dropna()

0    板橋區
1    中和區
3    土城區
dtype: object

In [9]:
#dataFrame
from numpy import nan as NA

data = pd.DataFrame([[1., 6.5, 3.],
                    [1., NA, NA],
                    [NA, NA, NA],
                    [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]